# Validate Heap Integrity
>[!NOTE]
> Originally based off notes from [llan-OuO](https://github.com/llan-OuO).
---
> Terminates a process when heap corruption is detected. - Microsoft


The *Validate Heap Integrity* exploit mitigation in Windows is a system-level mitigation mechanism that is enabled by default on most systems (Windows 11, and Windows Server). This mitigation aims to prevent the exploitation of application specific data which is stored on a heap from being exploited to gain control of the execution of a thread. The implementation of these defenses are a part of the Windows Heap Manager, not the application binary itself. The changes to the Windows Heap Manager not only validate the integrity of the objects allocated onto the heap, but additional restrictions and changes were implemented to ensure the Heap objects and the Heap itself remain in a consistent and valid un-modified state. There are two classes of mitigations applied on the Windows heap: Those that protect the metadata itself and those that provide non-determinism [2]. We will be focusing on those protections used to protect the metadata stored on the heap.
## Windows Heap Structure
> [!NOTE]
> Additional details can be found in the Writeup [Heap-Overflow-Example](https://github.com/DaintyJet/Heap-Overflow-Example).

The structure of a heap in the Windows operating system follows that of most modern systems. That is, when we make a call with the `malloc(...)` or the Windows-specific `HeapAlloc(...)` functions, we will be returned an address that points to data contained in a *heap chunk*. The allocation of a *heap chunk* depends on a number of factors, but it should be noted that the chunk we were allocated was either allocated as a whole to us, or was once a part of a larger chunk which has been fragmented to create a smaller series of *heap chunks* for our use. Generally a heap manager such as the one used in Windows will apply various strategies to limit the fragmentation of the heap - these strategies are often guided by *heuristics*.

The Windows heap manager is separated into a *Front-End* and a *Back-End*, We first interact with the Back-End allocator by default until our operations trigger the heuristics and we are switched to use the Front-End allocator. Specifically, once we make 18 or more allocations of the same size (*Less than 16kb each*) we will be switched over to the Front-End allocator which is commonly called a *Low Fragmentation Heap* (LFH) whose allocations are a part of a large heap chunk allocated to the Front-End by the Back-End allocator. This chunk is then made into a series of smaller blocks managed by the Front-End allocator, these smaller blocks are organized into *buckets* and those blocks in the bucket are not assigned in a linear fashion and their addresses may not be contiguous in nature so it is much harder to predict where or if there will be adjacent blocks allocated to our program. Exploits utilizing the Windows heap, therefore, try to avoid triggering the LFH as they want to reliably overflow or access an *adjacent chunk* to the one they control.

The metadata of a heap chunk is used by the heap manager during the normal management operations on the heap - one notable use is during a `free(...)` operation where adjacent chunks may be coalesced to reduce fragmentation. We are not particularly concerned with the contents of the metadata in the heap chunk, but we do need to keep in mind this header is stored on the heap at the head of it's associated data chunk.

> [!NOTE]
> Numerous historical attacks involved modifying the heap chunk's metadata to corrupt process information, such as the addresses stored in the global offset table when heap operations would be done on the corrupted chunk. Most of these attacks have been mitigated by protections discussed in later sections.

Below we can see an illustration of the Windows Heap's free list:

<img src="Images/Heap-List.png">

* `F-Link` (Flink): This is a pointer to the next entry on the free list. In the case this is a member of the *FreeLists*/*ListHints* object, this is a pointer to the first element on the free list [3].
* `B-Link` (Blink): This is a pointer to the previous entry on the free list. If this is a member of the *FreeLists*/*ListHints* object, this is used to determine if the LFH is active or should be activated, acting as a counter before activation and, once activated, will consist of a pointer to the `_HEAP_BUCKET` used in LFH, allocations.
* `Data`: The Chunk's data.

We can examine a `_HEAP_ENTRY` object that would be located on the heap using the command `dt _HEAP_ENTRY` in [WinDBG](https://learn.microsoft.com/en-us/windows-hardware/drivers/debugger/). In Windows 11 it has the following structure:

```
ntdll!_HEAP_ENTRY
   +0x000 UnpackedEntry    : _HEAP_UNPACKED_ENTRY
   +0x000 Size             : Uint2B
   +0x002 Flags            : UChar
   +0x003 SmallTagIndex    : UChar
   +0x000 SubSegmentCode   : Uint4B
   +0x004 PreviousSize     : Uint2B
   +0x006 SegmentOffset    : UChar
   +0x006 LFHFlags         : UChar
   +0x007 UnusedBytes      : UChar
   +0x000 ExtendedEntry    : _HEAP_EXTENDED_ENTRY
   +0x000 FunctionIndex    : Uint2B
   +0x002 ContextValue     : Uint2B
   +0x000 InterceptorValue : Uint4B
   +0x004 UnusedBytesLength : Uint2B
   +0x006 EntryOffset      : UChar
   +0x007 ExtendedBlockSignature : UChar
   +0x000 Code1            : Uint4B
   +0x004 Code2            : Uint2B
   +0x006 Code3            : UChar
   +0x007 Code4            : UChar
   +0x004 Code234          : Uint4B
   +0x000 AgregateCode     : Uint8B
```
> ![IMPORTANT]
> This structure is 8 bytes in size and is prepended to all data entries on the heap. This means in order to overwrite the data section of a heap chunk, this needs to be overwritten.
* `Size`: Size of the chunk in terms of the number of blocks, including the `_HEAP_ENTRY` that are required to store the data. 
* `Flags`: Flags used to denote the state of the chunk, examples include *Free* and *Busy*.
* `SmallTagIndex`: This stores the checksum of the heap entry, consisting of the XOR'ed value of the first three bytes of the `_HEAP_ENTRY` 
* `SubSegmentCode`: Contains information on the Sub-Section this may be a part of. 
* `PreviousSize`: Previous Size of Chunk.
* `SegmentOffset`: Contains Segment Offset.
* `LFHFlags`: Flags used to control the Low Fragmentation Heap. 
* `UnusedBytes`: Used to store unused bytes. Also used when LFH is activated.
